{"modelTopology":{"class_name":"Sequential","config":{"name":"rssiModel","layers":[{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true,"batch_input_shape":[null,3],"dtype":"float32"}},{"class_name":"Reshape","config":{"target_shape":[1,1,16],"name":"reshape_Reshape2","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose5","trainable":true}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D3","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose6","trainable":true}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D4","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose7","trainable":true}},{"class_name":"Conv2DTranspose","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose8","trainable":true}},{"class_name":"Sequential","config":{"name":"decoder","layers":[{"class_name":"Conv2DTranspose","config":{"filters":128,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose1","trainable":false,"batch_input_shape":[null,4,4,128],"dtype":"float32"}},{"class_name":"Conv2DTranspose","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose2","trainable":false}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D1","trainable":false}},{"class_name":"Conv2DTranspose","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose3","trainable":false}},{"class_name":"UpSampling2D","config":{"size":[2,2],"data_format":"channels_last","interpolation":"nearest","name":"up_sampling2d_UpSampling2D2","trainable":false}},{"class_name":"Conv2DTranspose","config":{"filters":16,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_transpose_Conv2DTranspose4","trainable":false}},{"class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":false}},{"class_name":"Dense","config":{"units":256,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":false}}]}}]},"keras_version":"tfjs-layers 4.15.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"dense_Dense8/kernel","shape":[3,16],"dtype":"float32"},{"name":"dense_Dense8/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose5/kernel","shape":[3,3,16,16],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose5/bias","shape":[16],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose6/kernel","shape":[3,3,32,16],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose6/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose7/kernel","shape":[3,3,64,32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose7/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose8/kernel","shape":[3,3,128,64],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose8/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/kernel","shape":[3,3,128,128],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose1/bias","shape":[128],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/kernel","shape":[3,3,64,128],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose2/bias","shape":[64],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose3/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose3/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose4/kernel","shape":[3,3,16,32],"dtype":"float32"},{"name":"conv2d_transpose_Conv2DTranspose4/bias","shape":[16],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[4096,256],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[256],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.15.0","convertedBy":null}